# Melt and Pivot

In [2]:
import pandas as pd
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Math": [85, 90, 95],
    "Science": [80, 85, 90],
    "English": [88, 92, 94]
}
df = pd.DataFrame(data)
df

      Name  Math  Science  English
0    Alice    85       80       88
1      Bob    90       85       92
2  Charlie    95       90       94

### Using melt()

In [5]:
df = df.melt(id_vars=['Name'], value_vars=['Math', 'Science', 'English'], var_name='Subject', value_name='Score')
df

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     90
2  Charlie     Math     95
3    Alice  Science     80
4      Bob  Science     85
5  Charlie  Science     90
6    Alice  English     88
7      Bob  English     92
8  Charlie  English     94

In [6]:
df = df.pivot(index='Name', columns='Subject', values='Score')
df

Subject  English  Math  Science
Name
Alice         88    85       80
Bob           92    90       85
Charlie       94    95       90